#==========================================================================================#
# >>>>> ПОДКЛЮЧЕНИЕ БИБЛИОТЕК И МОДУЛЕЙ <<<<< #
#==========================================================================================#

import os

#==========================================================================================#
# >>>>> МЕНЕДЖЕР <<<<< #
#==========================================================================================#
    
class Manager():
    
    #==========================================================================================#
    # >>>>> КОНСТРУКТОР <<<<< #
    #==========================================================================================#
    
    def __init__(self):
        pass

    def GetFreeID(self):

        # Получение списка файлов в директории.
        Files = os.listdir("Data")
        # Фильтрация только файлов формата JSON.
        Files = list(filter(lambda List: List.endswith(".json"), Files))
        
        if Files != []:
            # Список ID.
            RowsID = list()
            # Для каждого файла получить ID.
            for File in Files: RowsID.append(int(File.replace(".json", "")))

            # ID нового ряда.
            ID = None 

            # Для каждого числа до максимального ID.
            for Index in range(1, max(RowsID) + 1):

                # Если число не используется в качестве ID.
                if Index not in RowsID:
                    # Присвоение ID.
                    ID = Index
                    # Остановка цикла.
                    break

            # Если свободный ID не определён, назначить новый инкрементом.
            if not ID: ID = max(RowsID) + 1

        else: ID = 1

        return ID